# Wrong function - 1

Студент Миша ошибся при написании своей функции `process` и забыл добавить пролог. При этом с прологом его функция корректна и возвращает некоторое число. Но вот незадача - переписать его исходный код вы не можете. Напишите программу `Solve` в файле [solution.S](./solution.S), которая вызовет функцию `int64_t Process()` ровно один раз и напечатает возвращаемое число. Для вывода используйте `printf("%ld\n", number)` Прототип функции находится в файле [solution.hpp](./solution.hpp).

Не используйте `call Process`

Например, если Мишина функция такова:

```asm
mov rax, 4
mov rsp, rbp
pop rbp
ret
```

то ваша программа должна вывести число 4.
